{
    "AWS REL09-BP02": {
        "title": "백업 보안 및 암호화",
        "guide": [
            "1. 백업과 복원 자동화에 대한 액세스 권한을 데이터에 대한 액세스 권한과 동일하게 설정하였는가?",
            "2. 백업을 암호화하였는가?"
        ],
        "advantage": "백업의 보안을 유지하면 데이터 변조가 방지되며, 데이터 암호화는 데이터가 실수로 노출될 경우 해당 데이터에 대한 액세스를 방지함"
    },
    "AWS REL09-BP03": {
        "title": "자동으로 데이터 백업 수행",
        "guide": [
            "1. 백업을 수동으로 수행하는가?",
            "2. 백업을 지원하는 리소스를 사용하는 경우, 자동화 대상에 백업을 포함하고 있는가?"
        ],
        "advantage": "백업을 자동화하면 RPO를 기준으로 주기적으로 백업이 생성되며, 생성되지 않은 경우 알림을 보낸다."
    },
    "AWS REL09-BP04": {
        "title": "백업 무결성 및 프로세스를 확인하기 위해 데이터의 주기적인 복구 수행",
        "guide": [
            "1. 백업을 복원하지만 복원이 사용 가능한 상태인지 확인하기 위해 데이터를 쿼리하거나 검색하는가?",
            "2. 런북을 사용하지 않거나 설정된 자동화 절차를 벗어나 필요에 따라 복원하는가?"
        ],
        "advantage": "백업의 복구를 테스트하면 데이터가 손실되거나 손상되는 것을 걱정하지 않고 필요할 때 데이터를 복원할 수 있으며, 복원 및 복구가 워크로드의 RTO 내에 이루어지도록 하며, 데이터 손실이 있는 경우 워크로드의 RPO에 부합하도록 할 수 있다."
    },
    "AWS SEC02-BP03": {
        "title": "안전하게 보안 암호 저장 및 사용",
        "guide": [
            "1. 자격 증명을 교체하지 않는가?",
            "2. 소스코드 또는 구성 파일에 장기보안 인증 정보를 저장하는가?",
            "3. 보안 인증 정보를 저장 시 암호화되지 않은 상태로 저장하는가?"
        ],
        "advantage": "보안 인증 정보를 저장, 관리 및 교체하면 보안 인증 정보가 손상될 가능성을 줄이는데 도움이 됩니다."
    },
    "AWS SEC02-BP05": {
        "title": "정기적으로 보안 인증 정보 감사 및 교체",
        "guide": [
            "1. 보안 인증 정보 사용을 감사하는가?",
            "2. 장기 보안 인증 정보를 불필요하게 사용하는가?",
            "3. 장기 보안 인증 정보를 사용하고 정기적으로 교체하지 않는가?"
        ],
        "advantage": "보안 인증 정보를 주기적으로 감사하고 교체하여 리소스에 액세스하는 데 보안 인증 정보를 사용할 수 있는 기간을 제한합니다. 장기 보안 인증 정보는 많은 위험을 초래하며 이러한 위험은 장기 보안 인증 정보를 정기적으로 교체하여 줄일 수 있습니다."
    },
    "ISO/IEC 27002 8.4": {
        "title": "정보 백업",
        "guide": [
            "소스 코드, 개발 도구 및 소프트웨어 라이브러리에 대한 권한은 프로젝트 차원에서 철저히 관리되어야 합니다."
        ]
    },
    "ISO/IEC 27002 8.5": {
        "title": "안전한 인증",
        "guide": [
            "접근 제어 서비스 사용 시 내부 정책 기반의 인증 절차(MFA 등)를 구현하여야 합니다."
        ]
    },
    "ISO/IEC 27017 9.5.2": {
        "title": "가상 머신 강화",
        "guide": [
            "가상 머신을 구성하는 경우, 클라우드 서비스 사용자 및 제공자는 적절한 기술적 조치 및 보안환경 설정을 확인하여야 한다.",
            "- 불필요 포트 및 프로토콜/서비스 제거",
            "- 악성코드 방지 및 로깅"
        ]
    },
    "ISO/IEC 27002 5.21": {
        "title": "ICT 공급망에서의 정보 보안 관리",
        "guide": [
            "ICT 제품 및 서비스 공급망과 관련된 정보 보안 위험을 관리하기 위한 프로세스와 절차를 정의하고 구현해야 함."
        ]
    },
    "ISO/IEC 27002 5.16": {
        "title": "신원 관리",
        "guide": [
            "사용자 신원 정보에 대한 라이프사이클 관리를 진행하여야 합니다."
        ]
    },
    "ISO/IEC 27002 5.17": {
        "title": "인증 정보",
        "guide": [
            "인증 정보에 대한 할당과 관리에 대한 제어 규칙이 확립되어야 합니다."
        ]
    },
    "ISO/IEC 27002 5.18": {
        "title": "접근 권한",
        "guide": [
            "기업 자산에 대한 접근 권한은 내부 정책에 따라 제공되고 제한되어야 합니다."
        ]
    },
    "ISO/IEC 27002 5.25": {
        "title": "정보 보안 이벤트에 대한 평가 및 결정",
        "guide": [
            "로그 분석을 통하여 정보 보안 이벤트를 평가하고, 보안 사고로 분류될 것인지 결정하여야 합니다."
        ]
    },
    "ISO/IEC 27002 5.7/5.27": {
        "title": "위협 인텔리전스/정보 보안 사건에서 배우기",
        "guide": [
            "정보 보안 위협과 관련된 정보를 수집하여 위협 인텔리전스를 확립하고, 이를 기반으로 정보 보안 제어를 강화 및 개선하여야 합니다."
        ]
    },
    "ISO/IEC 27002 5.29": {
        "title": "중단 시의 정보 보안",
        "guide": [
            "가용 중단 시의 보안에 대한 계획 또한 수립하여야 합니다."
        ]
    },
    "ISO/IEC 27018 12.1.4": {
        "title": "개발, 테스트 및 운영 환경 분리",
        "guide": [
            "테스트 목적의 PII(개인 식별 정보) 사용은 피하여야 하며, 불가 시 위험 평가를 수행하여야 합니다."
        ]
    },
    "ISO/IEC 27018 12.4.2": {
        "title": "정보 이전 정책 및 절차",
        "guide": [
            "로그 정보에 PII(개인 식별 정보)가 포함되는가를 고려하여야 하며, 기록 정보가 의도된 용도로만 사용될 수 있도록 추가적인 절차를 마련하여야 합니다."
        ]
    },
    "AWS PERF01-BP02": {
        "title": "적절한 지침을 사용한 아키텍처 구성",
        "guide": [
            "AWS 서비스를 설계 의도와 다른 방식으로 사용하고 있는가?",
            "비즈니스 상황을 고려하지 않고 모든 지침을 따르고 있는가?"
        ],
        "advantage": "워크로드에 적합한 아키텍처를 선택하고 의사 결정에 확신을 얻을 수 있다."
    },
    "AWS PERF01-BP03": {
        "title": "비용을 고려한 아키텍처 결정",
        "guide": [
            "인스턴스 패밀리를 하나만 사용하고 있는가?",
            "스토리지 수명 주기 정책을 정의하지 않는가?",
            "AWS 클라우드의 새로운 서비스 및 기능을 검토하지 않는가?",
            "블록 스토리지만 사용하는가?"
        ],
        "advantage": "보다 효율적인 리소스를 사용하고 다른 투자 기회를 모색할 수 있다."
    },
    "AWS PERF01-BP07": {
        "title": "데이터 기반 접근 방식을 사용한 아키텍처 선택",
        "guide": [
            "도입한 간이 흘렀음에도 현재 아키텍처가 정적 아키텍처가 되고 업데이트하지 않아도 된다고 가정하는가?",
            "아키텍처는 추측과 가정을 기반으로 선택하는가?",
            "시간이 지나면 타당한 이유 없이 아키텍처 변경을 도입하는가?"
        ],
        "advantage": "아키텍처 선택에 대한 접근 방식을 잘 정의하면 데이터를 사용하여 워크로드 설계에 영향을 미치고 시간이 지남에 따라 정보에 입각한 의사 결정을 내릴 수 있다."
    },
    "AWS PERF02-BP01": {
        "title": "워크로드에 가장 적합한 컴퓨팅 옵션 선택",
        "guide": [
            "온프레미스에서 사용하던 컴퓨팅 옵션과 동일한 옵션만 사용하는가?",
            "클라우드 컴퓨팅 옵션",
            "기능 및 솔루션과 이러한 솔루션이 컴퓨팅 성능을 어떻게 개선할 수 있는지를 잘 모르는가?",
            "대체 컴퓨팅 옵션이 워크로드 특성에 보다 적절한데도 스케일링 또는 성능 요구 사항을 충족하려고 기존 컴퓨팅 옵션을 과도하게 프로비저닝하는가?"
        ],
        "advantage": "컴퓨팅 요구 사항을 파악하고 사용 가능한 옵션과 비교하여 평가하면 워크로드를 보다 리소스 효율적으로 만들 수 있다."
    },
    "AWS PERF02-BP05": {
        "title": "컴퓨팅 리소스 동적 확장",
        "guide": [
            "용량을 수동으로 늘려 경고에 대응하는가?",
            "온프레미스에서와 동일한 크기 조정 가이드라인을 사용하는가?",
            "조정 이벤트 후에 다시 축소하는 대신 증가된 용량을 그대로 두는가?"
        ],
        "advantage": "컴퓨팅 리소스의 탄력성을 구성하고 테스트하면 비용을 절감하고, 성능 벤치마크를 유지하며, 트래픽 변화에 따른 안정성을 개선하는 데 도움이 된다."
    },
    "AWS PERF03-BP01": {
        "title": "목적별 데이터 스토어 사용",
        "guide": [
            "하나의 특정 데이터베이스 솔루션에 대한 내부 경험과 지식만 있어 하나의 데이터 스토어만 고수하는가?",
            "모든 워크로드의 데이터 스토리지 및 액세스 요구 사항이 비슷하다고 가정하는가?",
            "데이터 자산의 인벤토리 등록을 위한 데이터 카탈로그를 구현하지 않았는가?"
        ],
        "advantage": "데이터 특성과 요구 사항을 파악하면 워크로드 요구 사항을 충족하는 가장 효율적이고 성능이 뛰어난 스토리지 기술을 결정할 수 있다."
    },
    "AWS PERF03-BP02": {
        "title": "데이터 스토어에 사용 가능한 구성 옵션 평가",
        "guide": [
            "모든 워크로드에 Amazon EBS와 같은 하나의 스토리지 유형만 사용하는가?",
            "모든 스토리지 계층을 기준으로 한 실제 테스트 없이 워크로드 전체에 프로비저닝된 IOPS를 사용하는가?",
            "선택한 데이터 관리 솔루션의 구성 옵션을 알지 못하는가?",
            "다른 사용 가능한 구성 옵션을 고려하지 않고 인스턴스 크기만 늘리는가?"
        ],
        "advantage": "데이터 스토어 구성을 탐색하고 실험해보면 인프라 비용을 절감하고 성능을 개선하며 워크로드를 유지 관리하는 데 필요한 노력을 줄일 수 있다."
    },
    "AWS PERF03-BP05": {
        "title": "캐싱을 활용한 데이터 액세스 패턴 구현",
        "guide": [
            "자주 변경되는 데이터를 캐시하는가?",
            "캐시된 데이터가 마치 영구적으로 저장되고 항상 사용 가능한 것처럼 의존하는가?",
            "캐시된 데이터의 일관성은 고려하지 않는가?",
            "캐싱 구현의 효율성을 모니터링하지 않는가?"
        ],
        "advantage": "캐시에 데이터를 저장하면 읽기 지연 시간, 읽기 처리량, 사용자 경험 및 전반적인 효율성을 개선하고 비용을 절감할 수 있다."
    },
    "AWS PERF04-BP01": {
        "title": "네트워킹이 성능에 미치는 영향 파악",
        "guide": [
            "모든 트래픽이 기존 데이터 센터를 통과하는가?",
            "클라우드 네이티브 네트워크 보안 도구를 사용하는 대신 중앙 방화벽을 통해 모든 트래픽을 라우팅하는가?",
            "실제 사용 요구 사항을 이해하지 않고 AWS Direct Connect 연결을 프로비저닝하는가?",
            "네트워킹 솔루션을 정의할 때 워크로드 특성과 암호화 오버헤드를 고려하지 않는가?"
        ],
        "advantage": "네트워킹이 워크로드 성능에 미치는 영향을 이해하면 잠재적인 병목 현상을 식별하고, 사용자 경험을 개선하고, 신뢰성을 높이고, 워크로드 변화에 따라 운영 유지 관리 작업을 줄이는 데 도움이 된다."
    },
    "AWS PERF04-BP03": {
        "title": "워크로드에 적합한 전용 연결 또는 VPN 선택",
        "guide": [
            "네트워크 암호화 요구 사항에 대해서만 VPN 솔루션을 평가하는가?",
            "백업 또는 이중화된 연결 옵션은 평가하지 않는가?",
            "모든 워크로드 요구 사항(암호화",
            "프로토콜",
            "대역폭 및 트래픽 요구 사항)을 식별할 수는 없는가?"
        ],
        "advantage": "적절한 연결 솔루션을 선택하고 구성하면 워크로드의 안정성이 향상되고 성능이 극대화된다. 워크로드 요구 사항을 파악하고, 미리 계획하고, 하이브리드 솔루션을 평가하여 비용이 많이 드는 물리적 네트워크 변경과 운영 오버헤드를 최소화하는 동시에 가치 실현 시간을 단축할 수 있다."
    }
}